[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=4
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=400
max_batches = 18000
policy=steps
steps=14400,16200
scales=.1,.1

#conv1

[convolutional] 
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#conv2

[convolutional] 
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#conv3

[convolutional] 
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#conv4

[convolutional] 
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

#conv5=add_conv4_2

[convolutional] 
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

#conv6=add_conv4_3
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#conv7
[convolutional] 
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#conv8 = add 7-2
[convolutional] 
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#conv9 = add 7-3
[convolutional] 
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#conv10
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

#conv11 = add 10-2
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#conv12 = add 10-3
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

#conv13
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=42
activation=linear
#filters = 3 * ( classes + 5 )filters = 3 * ( classes + 5 )


[yolo]
mask = 3,4,5
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=9
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 10

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=42
activation=linear

[yolo]
mask = 0,1,2
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=9
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
